app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 4], ["LIMIT", 1]]
---
  def index
    if comments_params[:user_id].present?
      render json: Comment.find_by(user_id: comments_params[:user_id])
    else
      render json: Comment.find_by(artwork_id: comments_params[:artwork_id])