app/controllers/users_controller.rb

  def index
    if params[:query].present?
      user = User.where("users.username LIKE '%#{params[:query]}%'")
      render json: user
    else
      render json: User.all
---
SELECT "users".* FROM "users" WHERE (users.username LIKE '%oe%')
SELECT "users".* FROM "users"

  def show_favorites
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def add_favorite
    user = User.find(params[:id])
    artwork = Artwork.find(params[:artwork_id])

    if user.shared_or_owned.include?(artwork)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def delete_favorite
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]