app/models/user.rb

  def favorite(artwork)
    Favorite.create!(user_id: self.id, artwork_id: artwork)
---
INSERT INTO "favorites" ("user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["artwork_id", 1], ["created_at", "2019-04-30 14:05:55.814722"], ["updated_at", "2019-04-30 14:05:55.814722"]]

  def unfavorite(artwork)
    Favorite.where(user_id: self.id, artwork_id: artwork).destroy_all
---
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 4]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1 AND "favorites"."artwork_id" = $2  [["user_id", 1], ["artwork_id", 1]]